## Conductional Seletion in Pandas

In [69]:
import numpy as np
import pandas as pd

In [70]:
data = np.random.randint(0,20,(4,4))

In [71]:
index = "A B C D".split(" ")
col = "W X Y Z".split(' ')

In [72]:
df = pd.DataFrame(data,index=index,columns=col)

In [73]:
df

    W   X   Y   Z
A   3  16   2   2
B  16   2   8   9
C   9  19  19   4
D  15   7   4  17

In [74]:
df[df > 4]

      W     X     Y     Z
A   NaN  16.0   NaN   NaN
B  16.0   NaN   8.0   9.0
C   9.0  19.0  19.0   NaN
D  15.0   7.0   NaN  17.0

In [75]:
df["W"] > 10

A    False
B     True
C    False
D     True
Name: W, dtype: bool

In [76]:
df[df["W"]>4]

    W   X   Y   Z
B  16   2   8   9
C   9  19  19   4
D  15   7   4  17

In [77]:
# used multi conduction on sigle statement
df[(df["W"] > 4 ) & ( df["X"]<30)]

    W   X   Y   Z
B  16   2   8   9
C   9  19  19   4
D  15   7   4  17

In [78]:
# index in dataframe
df.reset_index()

  index   W   X   Y   Z
0     A   3  16   2   2
1     B  16   2   8   9
2     C   9  19  19   4
3     D  15   7   4  17

In [79]:
new_index = "AA BB CC DD".split(" ")

In [80]:
df["new_index"] =  new_index

In [81]:
df

    W   X   Y   Z new_index
A   3  16   2   2        AA
B  16   2   8   9        BB
C   9  19  19   4        CC
D  15   7   4  17        DD

In [83]:
df.set_index("new_index",inplace=True) # new_index is set to the dataframe

In [84]:
df

            W   X   Y   Z
new_index
AA          3  16   2   2
BB         16   2   8   9
CC          9  19  19   4
DD         15   7   4  17

In [85]:
df.loc["AA","W"]

3

In [86]:
df

            W   X   Y   Z
new_index
AA          3  16   2   2
BB         16   2   8   9
CC          9  19  19   4
DD         15   7   4  17